https://www.susanjfowler.com/blog/2016/8/13/so-you-want-to-learn-physics
https://www.physicsforums.com/forums/science-and-math-textbooks.21/

# C-c C-x C-l :: Latex preview of section

* Language
** Spanish
*** TODO Workbook in Spanish: Three Years [0%]
**** TODO Part I :: Verbs[0%]
***** TODO Lesson 1 :: Present Tense
***** TODO Lesson 2 :: Present Tense of Stem Changing Verbs 
***** TODO Lesson 3 :: Spelling Changes in the Present Tense
***** TODO Lesson 4 :: Preterite Tense
***** TODO Lesson 5
***** TODO Lesson 6
***** TODO Lesson 7
***** TODO Lesson 8 
***** TODO Lesson 9
***** TODO Lesson 10 
***** TODO Lesson 11
***** TODO Lesson 12
***** TODO Lesson 13
***** TODO Lesson 14
***** TODO Lesson 15
***** TODO Lesson 16
***** TODO Lesson 17
***** TODO Lesson 18
**** TODO Part II :: Grammatical Structures [%]
**** TODO Part III :: Idioms [%]
**** TODO Part IV :: Civilization [%]
**** TODO Part V :: Composition 
**** TODO Part VI :: Comprehension
**** TODO Part VII :: Auditory Comprehension 
*** TODO pomo with harry potter too, really understand though dont just skim
    SCHEDULED: <2017-07-25 Tue ++1w>
    
*** TODO Duolingo
    SCHEDULED: <2017-07-29 Sat +1d>
    :PROPERTIES:
    :LAST_REPEAT: [2017-07-31 Mon 21:48]
    :END:
    - State "DONE"       from "TODO"       [2017-07-31 Mon 21:48]
    - State "DONE"       from "TODO"       [2017-07-28 Fri 23:05]
    - State "DONE"       from "TODO"       [2017-07-26 Wed 21:54]
    - State "DONE"       from "TODO"       [2017-07-25 Tue 20:28]
    - State "DONE"       from "TODO"       [2017-07-24 Mon 20:25]
    - State "DONE"       from "TODO"       [2017-07-24 Mon 19:53]
**** Do a section each day - set up microphone too
*** TODO Write en Español 
    SCHEDULED: <2017-07-27 Thu ++1w>

** French
  + aim for 2 exercises/day
  + find some french news to watch
  + look for french podcast
  + read sartre/ others
  + translate/write
  
* Physics - Undergrad
  + check out phys forum link if any of these are too pricey
  + take notes with latex - or even just copying examples
    + link them to this file but only after getting latex preview to work in org - not as a copout
    + http://orgmode.org/manual/External-links.html
  + use locate to find org.el if needed 
    + https://www.howtogeek.com/112674/how-to-find-files-and-folders-in-linux-using-the-command-line/
** TODO Calculus [%]
   :LOGBOOK:
   CLOCK: [2017-07-20 Thu 20:47]--[2017-07-20 Thu 21:12] =>  0:25
   CLOCK: [2017-07-18 Tue 22:18]--[2017-07-18 Tue 22:43] =>  0:25
   CLOCK: [2017-07-17 Mon 23:16]--[2017-07-17 Mon 23:41] =>  0:25
   :END:
*** TODO Chapter 2 :: Differentiation
**** 2.1 Derivative, tangent line
***** Definition of derivative  
      \[
      f'(x) = \lim_{\Delta\to 0}\frac{f(x+\Delta x)-f(x)}{\Delta x}
      \]
**** 2.2 Basic Derivative Rules
      \[
      \frac{d}{dx}[sin x] = cos x
      \]
      \[
      \frac{d}{dx}[cos x] = sin x
      \]
**** 2.3 Product and Quotient
     \[
     \frac{d}{dx} vu = u'v + v'u
     \]
     \[
     \frac{d}{dx} \left[\frac{u}{v}\right] = \frac{u'v - v'u}{v^2}
     \]
**** 2.4 Chain Rule 
     \[
     \frac{d}{dx}[f(u)] = f'(u)u'
     \]
**** 2.5 Implicit Differentiation
***** Chain rule with d/dx as placeholder for actual derivative
**** 2.6 Related Rates
***** Differentiation with respect to time 
**** DONE Problem set ch 2 (maybe use that ruby problem set generator? - there are a lot here)
     CLOSED: [2017-07-23 Sun 15:42]
*** TODO Chapter 3 :: Applications of Differentiation
*** 4-9
  
** TODO University Physics - Mechanics (Physics I)[0%]
  + this should be quick but do not rush
*** TODO Chapter 1 :: Units, Vector
**** 1.10 Products of Vectors 
***** Dot Product (Scalar Product) 
     \[
     \overrightarrow{\textit{\textbf{A}}}\cdot\overrightarrow{\textit{\textbf{B}}} = \textit{AB}\cos\phi = |\overrightarrow{\textit{\textbf{A}}}||\overrightarrow{\textit{\textbf{B}}}|\cos\phi
     \]
     \[
     \overrightarrow{\textit{\textbf{A}}}\cdot\overrightarrow{\textit{\textbf{B}}} =A_{x}B_{x} + A_{y}B_{y} +A_{z}B_{z}
     \]
***** Cross Product ( Vector Product)
     - Perpendicular to plane of components (right hand rule)
     - C = 0 when A and B are parallel or antiparallel
       
      \[
      C = AB\sin\phi
      \] (Magnitude of cross product of \[ \overrightarrow{\textit{\textbf{A}}} \] and \[ \overrightarrow{\textit{\textbf{B}}} \] )  
     - add below verbose form
      \[
      \overrightarrow{\textit{\textbf{A}}} \times \overrightarrow{\textit{\textbf{B}}} = \left| \begin{array}{ccc} \hat{i} & \hat{j} & \hat{k} \\ A_{x} & A_{y} & A_{z} \\ B_{x} & B_{y} & B_{z} \end{array} \right|
      \]
***** TODO Exercises pg. 29 (easy or medium in probset.rb)
*** TODO Chapter 2
*** TODO Chapter 3
*** TODO Chapter 4
*** TODO Chapter 5
*** TODO Chapter 6
*** TODO Chapter 7
*** TODO Chapter 8
*** TODO Chapter 9
*** TODO Chapter 10
*** TODO Chapter 11
*** TODO Chapter 12
*** TODO Chapter 13
*** TODO Chapter 14
*** TODO Chapter 15
*** TODO Chapter 16
*** TODO Chapter 17
*** TODO Chapter 18
*** TODO Chapter 19
*** TODO Chapter 20
** University Physics - Electrodynamics (Physics II)
*** Chapter 21-44 
  + same as above dont rush, foundational
  + also have text from physics II but this book looks good 
** Advanced Engineering Mathematics
   - consider doing vector calc and linear algebra concurrent with ODEs 
** Vibrations/waves - see amazon
** Phys IV book
  + slow, really understand
  + did not do well here before 
  
** Taylor Mechanics
  + expensive, use pdf
  + do alongside Phys IV
  + see amazon/top links for supplements/ prob sets
  + do a lot of problems - maybe all
  + this is bread and butter - prob most core
  
** vector calc
  + do with above, if not sooner
  + very important
  + May not be necessary, compare to vector section in Engineering Math.
** Griffiths e&m
  + do all probs

** Griffiths Quantum
  + do all probs
  
** Thermodynamics
  + you have a book at home to do - not sure on quality
  + amazon cart has a thermo book too - pretty cheap
** The Cosmic Perspective
  + Do at any time probably around phys IV
** Introduction to Cosmology
  + Do after the Cosmic Perspective

** Extra bits
  + Astrophys - amazon cart - pricey
  + electronics - amazon cart, check out the pedal thing brandon was doing, sautering iron needed
  + particle phys - amazon cart, expensive - check out the link first
  
* Physics - Grad

** Math methods
  + Arfken - welcome to hell
    + do it this time
    + really understand
  + complex analysis, group theory, fourier series - see amazon for all, some pricey but this is way down the road
  
** Electrodynamics
  + Jackson of course
  
** Quantum mechanics
  + Sakurai - amzon cart - very expensive
  + Quantum Mechanics and Path Integrals by Feynman - cheap on amazon
  + Shankar - amazon - pricey
  + Decoherence and the Appearance of a Classical World in Quantum Theory - amazon - pricey
  + Dirac Principles of QM - relatively cheap - written by Dirac so get
  + The Everett Interpretation of Quantum Mechanics: Collected Works 1955-1980 - amazon - somewhat expensive but looks good
  
** Statistical Mechanics 
  + Statistical Mechanics by Pathria and Beale - amazon - pricey
  + Huang - amazon - pricey
 
** General Relativity
  + Carroll - essential - amazon - not bad
  + there is one on shelf not sure author but check it out
  + Wald's General Relativity - cheap
  + Gravitation by Misner, Thorne, and Wheeler - waaaay expensive
  + Weinberg's Gravitation and Cosmology - WAAAAAAAAAYYYY expensive
  + A Comprehensive Introduction to Differential Geometry by Spivak - pretty cheap - cartoon pirates cover?
   
** Quantum Field Theory
   + Zee's Quantum Field Theory in a Nutshell - not bad price amazon
   + An Introduction to Quantum Field Theory by Peskin and Schroeder - not bad price amazon
   + Weinberg's The Quantum Theory of Fields, Volume 1 - not bad price amazon 
   + Lie Algebras in Particle Physics by Georgi - not bad price amazon
   
     
   
